Tekla.Structures.CatalogInternal.dotcatUserPropertyOption_t
Serialization structure for UserPropertyOption.

Tekla.Structures.CatalogInternal.dotcatUserPropertyOption_t.IntValue
Integer option value.

Tekla.Structures.CatalogInternal.dotcatUserPropertyOption_t.DoubleValue
Double option value.

Tekla.Structures.CatalogInternal.dotcatUserPropertyOption_t.StringValue
String option value.

Tekla.Structures.CatalogInternal.dotcatUserPropertyOption_t.OptionLabel
Option name.

Tekla.Structures.CatalogInternal.dotcatUserPropertyOption_t.OptionLabelTranslated
Translated option name.